nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_176x_IC_1_REG.h
/*
 * File:           C:\Users\jberlin\OneDrive - Analog Devices, Inc\SigmaDSP with Microcontrollers\SIMPLE SigmaDSP Teensy Project\lib\SigmaStudio\Simple_SS_Project_176x_IC_1_REG.h
 *
 * Created:        Wednesday, April 1, 2020 1:54:21 PM
 * Description:    Simple_SS_Project_176x:IC 1 control register definitions.
 *
 * This software is distributed in the hope that it will be useful,
 * but is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
 * CONDITIONS OF ANY KIND, without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *
 * This software may only be used to program products purchased from
 * Analog Devices for incorporation by you into audio products that
 * are intended for resale to audio product end users. This software
 * may not be distributed whole or in any part to third parties.
 *
 * Copyright ©2020 Analog Devices, Inc. All rights reserved.
 */
#ifndef __SIMPLE_SS_PROJECT_176X_IC_1_REG_H__
#define __SIMPLE_SS_PROJECT_176X_IC_1_REG_H__


/* ClkCtrlRegister  - Registers (IC 1) */
#define REG_CLKCTRLREGISTER_IC_1_ADDR             0x4000
#define REG_CLKCTRLREGISTER_IC_1_BYTE             1
#define REG_CLKCTRLREGISTER_IC_1_VALUE            0xF

/* RegPowCtrlRegister  - Registers (IC 1) */
#define REG_REGPOWCTRLREGISTER_IC_1_ADDR          0x4001
#define REG_REGPOWCTRLREGISTER_IC_1_BYTE          1
#define REG_REGPOWCTRLREGISTER_IC_1_VALUE         0x0

/* PLLCrlRegister  - Registers (IC 1) */
#define REG_PLLCRLREGISTER_IC_1_ADDR              0x4002
#define REG_PLLCRLREGISTER_IC_1_BYTE              6
#define REG_PLLCRLREGISTER_IC_1_VALUE             0x00FD000C2001

/* MicCtrlRegister  - Registers (IC 1) */
#define REG_MICCTRLREGISTER_IC_1_ADDR             0x4008
#define REG_MICCTRLREGISTER_IC_1_BYTE             1
#define REG_MICCTRLREGISTER_IC_1_VALUE            0x0

/* Record Pwr Management  - Registers (IC 1) */
#define REG_RECORD_PWR_MANAGEMENT_IC_1_ADDR       0x4009
#define REG_RECORD_PWR_MANAGEMENT_IC_1_BYTE       1
#define REG_RECORD_PWR_MANAGEMENT_IC_1_VALUE      0x0

/* Record Mixer Left Ctrl 0  - Registers (IC 1) */
#define REG_RECORD_MIXER_LEFT_CTRL_0_IC_1_ADDR    0x400A
#define REG_RECORD_MIXER_LEFT_CTRL_0_IC_1_BYTE    1
#define REG_RECORD_MIXER_LEFT_CTRL_0_IC_1_VALUE   0x1

/* Record Mixer Left Ctrl 1  - Registers (IC 1) */
#define REG_RECORD_MIXER_LEFT_CTRL_1_IC_1_ADDR    0x400B
#define REG_RECORD_MIXER_LEFT_CTRL_1_IC_1_BYTE    1
#define REG_RECORD_MIXER_LEFT_CTRL_1_IC_1_VALUE   0x5

/* Record Mixer Right Ctrl 0  - Registers (IC 1) */
#define REG_RECORD_MIXER_RIGHT_CTRL_0_IC_1_ADDR   0x400C
#define REG_RECORD_MIXER_RIGHT_CTRL_0_IC_1_BYTE   1
#define REG_RECORD_MIXER_RIGHT_CTRL_0_IC_1_VALUE  0x1

/* Record Mixer Right Ctrl 1  - Registers (IC 1) */
#define REG_RECORD_MIXER_RIGHT_CTRL_1_IC_1_ADDR   0x400D
#define REG_RECORD_MIXER_RIGHT_CTRL_1_IC_1_BYTE   1
#define REG_RECORD_MIXER_RIGHT_CTRL_1_IC_1_VALUE  0x5

/* Record Volume Ctrl Left  - Registers (IC 1) */
#define REG_RECORD_VOLUME_CTRL_LEFT_IC_1_ADDR     0x400E
#define REG_RECORD_VOLUME_CTRL_LEFT_IC_1_BYTE     1
#define REG_RECORD_VOLUME_CTRL_LEFT_IC_1_VALUE    0x0

/* Record Volume Ctrl Right  - Registers (IC 1) */
#define REG_RECORD_VOLUME_CTRL_RIGHT_IC_1_ADDR    0x400F
#define REG_RECORD_VOLUME_CTRL_RIGHT_IC_1_BYTE    1
#define REG_RECORD_VOLUME_CTRL_RIGHT_IC_1_VALUE   0x0

/* Record Mic Bias Control  - Registers (IC 1) */
#define REG_RECORD_MIC_BIAS_CONTROL_IC_1_ADDR     0x4010
#define REG_RECORD_MIC_BIAS_CONTROL_IC_1_BYTE     1
#define REG_RECORD_MIC_BIAS_CONTROL_IC_1_VALUE    0x0

/* ALC Control 0  - Registers (IC 1) */
#define REG_ALC_CONTROL_0_IC_1_ADDR               0x4011
#define REG_ALC_CONTROL_0_IC_1_BYTE               1
#define REG_ALC_CONTROL_0_IC_1_VALUE              0x0

/* ALC Control 1  - Registers (IC 1) */
#define REG_ALC_CONTROL_1_IC_1_ADDR               0x4012
#define REG_ALC_CONTROL_1_IC_1_BYTE               1
#define REG_ALC_CONTROL_1_IC_1_VALUE              0x0

/* ALC Control 2  - Registers (IC 1) */
#define REG_ALC_CONTROL_2_IC_1_ADDR               0x4013
#define REG_ALC_CONTROL_2_IC_1_BYTE               1
#define REG_ALC_CONTROL_2_IC_1_VALUE              0x0

/* ALC Control 3  - Registers (IC 1) */
#define REG_ALC_CONTROL_3_IC_1_ADDR               0x4014
#define REG_ALC_CONTROL_3_IC_1_BYTE               1
#define REG_ALC_CONTROL_3_IC_1_VALUE              0x0

/* Serial Port Control 0  - Registers (IC 1) */
#define REG_SERIAL_PORT_CONTROL_0_IC_1_ADDR       0x4015
#define REG_SERIAL_PORT_CONTROL_0_IC_1_BYTE       1
#define REG_SERIAL_PORT_CONTROL_0_IC_1_VALUE      0x0

/* Serail Port Control 1  - Registers (IC 1) */
#define REG_SERAIL_PORT_CONTROL_1_IC_1_ADDR       0x4016
#define REG_SERAIL_PORT_CONTROL_1_IC_1_BYTE       1
#define REG_SERAIL_PORT_CONTROL_1_IC_1_VALUE      0x0

/* Converter Ctrl 0  - Registers (IC 1) */
#define REG_CONVERTER_CTRL_0_IC_1_ADDR            0x4017
#define REG_CONVERTER_CTRL_0_IC_1_BYTE            1
#define REG_CONVERTER_CTRL_0_IC_1_VALUE           0x0

/* Converter Ctrl 1  - Registers (IC 1) */
#define REG_CONVERTER_CTRL_1_IC_1_ADDR            0x4018
#define REG_CONVERTER_CTRL_1_IC_1_BYTE            1
#define REG_CONVERTER_CTRL_1_IC_1_VALUE           0x0

/* ADC Control 0  - Registers (IC 1) */
#define REG_ADC_CONTROL_0_IC_1_ADDR               0x4019
#define REG_ADC_CONTROL_0_IC_1_BYTE               1
#define REG_ADC_CONTROL_0_IC_1_VALUE              0x13

/* ADC Control 1  - Registers (IC 1) */
#define REG_ADC_CONTROL_1_IC_1_ADDR               0x401A
#define REG_ADC_CONTROL_1_IC_1_BYTE               1
#define REG_ADC_CONTROL_1_IC_1_VALUE              0x0

/* ADC Control 2  - Registers (IC 1) */
#define REG_ADC_CONTROL_2_IC_1_ADDR               0x401B
#define REG_ADC_CONTROL_2_IC_1_BYTE               1
#define REG_ADC_CONTROL_2_IC_1_VALUE              0x0

/* Playback Mixer Left Control 0  - Registers (IC 1) */
#define REG_PLAYBACK_MIXER_LEFT_CONTROL_0_IC_1_ADDR 0x401C
#define REG_PLAYBACK_MIXER_LEFT_CONTROL_0_IC_1_BYTE 1
#define REG_PLAYBACK_MIXER_LEFT_CONTROL_0_IC_1_VALUE 0x21

/* Plaback Mixer Left Control 1  - Registers (IC 1) */
#define REG_PLABACK_MIXER_LEFT_CONTROL_1_IC_1_ADDR 0x401D
#define REG_PLABACK_MIXER_LEFT_CONTROL_1_IC_1_BYTE 1
#define REG_PLABACK_MIXER_LEFT_CONTROL_1_IC_1_VALUE 0x0

